app/views/users/index.html.erb

SELECT COUNT(*) FROM "conferences" INNER JOIN "conferences_users" ON "conferences"."id" = "conferences_users"."conference_id" WHERE "conferences_users"."user_id" = ?  [["user_id", 1]]
---
          <div class="card-body">
            <p class="card-text"><%= pluralize(user.conferences.count, "conference") %></p>