app/views/users/search.html.erb

          <div class="card-body">
            <p class="card-text"><%= pluralize(result.conferences.count, "conference") %></p>
---
SELECT COUNT(*) FROM "conferences" INNER JOIN "conferences_users" ON "conferences"."id" = "conferences_users"."conference_id" WHERE "conferences_users"."user_id" = ?  [["user_id", 5]]