app/views/users/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "conferences_users" ON "users"."id" = "conferences_users"."user_id" WHERE "conferences_users"."conference_id" = ?  [["conference_id", 4]]
---
          <p class="card-text">Abstract: <%= truncate( conference.abstract, length: 100) %></p>
          <p class="card-text">Attendees: <%=   conference.users.map { |user| user.username}.to_sentence %></p>