app/views/conferences/_form.html.erb

                  <h5 style="display-block">Speaker</h5>
                  <%= form.collection_select(:user_id, User.all, :id,   :username,
                              { multiple: false, size: 4, class: "dropdown-menu" }) %>
---
SELECT "users".* FROM "users"

                  <hr>
                  <%= form.collection_check_boxes :user_ids, User.all, :id, :username do |an| %>
---
SELECT "users"."id" FROM "users" WHERE "users"."conference_id" = ?  [["conference_id", 1]]