app/views/conferences/search.html.erb

              <p class="card-text">Abstract: <%= truncate(result.abstract, length: 100) %></p>
              <p class="card-text">Attendees: <%= result.users.map { |user| user.username}.to_sentence %></p>
---
SELECT "users".* FROM "users" INNER JOIN "conferences_users" ON "users"."id" = "conferences_users"."user_id" WHERE "conferences_users"."conference_id" = ?  [["conference_id", 2]]