app/controllers/conferences_controller.rb

  def index
    @conferences = Conference.all
---
SELECT "conferences".* FROM "conferences"

  def create
    @conference = Conference.new(conference_params)

    respond_to do |format|
      if @conference.save
---
INSERT INTO "conferences" ("title", "abstract", "room", "speaker", "attendees", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "CILLUM NON"], ["abstract", "test1"], ["room", 2], ["speaker", 1], ["attendees", 1], ["created_at", "2022-07-12 20:12:52.316620"], ["updated_at", "2022-07-12 20:12:52.316620"]]

  def update
    respond_to do |format|
      if @conference.update(conference_params)
---
UPDATE "conferences" SET "abstract" = ?, "updated_at" = ? WHERE "conferences"."id" = ?  [["abstract", "test1 ghghgh"], ["updated_at", "2022-07-12 20:48:24.502393"], ["id", 1]]

  def destroy
    @conference.destroy
---
DELETE FROM "conferences" WHERE "conferences"."id" = ?  [["id", 3]]

    def set_conference
      @conference = Conference.find(params[:id])
---
SELECT "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]