app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (lower(username || company) LIKE '%vane%')
---
    def search
        if params[:search].blank?
            flash[:alert] = "Please enter a search first"
            redirect_to users_path and return
        else
            @parameter = params[:search].downcase
            @results = User.all.where("lower(username || company) LIKE :search", search: "%#{@parameter}%")

UPDATE "users" SET "updated_at" = ?, "bio" = ? WHERE "users"."id" = ?  [["updated_at", "2022-07-13 21:37:49.772382"], ["bio", "algo1"], ["id", 1]]
---
    def update

        if @user.update(user_params)

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "bio", "company", "password_digest", "conference_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save